Revit 2027 API
RoutingPreferenceRule Properties
The RoutingPreferenceRule type exposes the following members.
Properties
Name | Description
Description |  The description of the routing preference rule.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
MEPPartId |  The referenced MEPPart (segment or fitting) type in this rule. It may be InvalidElementId if no MEPPart will be allowed when the conditions satisfy the criteria in this rule.
NumberOfCriteria |  Gets the number of routing criteria.
RoutingPreferenceManager |  Gets the routing preference manager that owns this rule.
Top
See Also
Reference
RoutingPreferenceRule Class
Autodesk.Revit.DB Namespace